In [1]:
import pandas as pd

In [ ]:
# 예시 csv 데이터 불러오기
titanic_df = pd.read_csv('./titanic_train.csv')
print(f'titanic 변수 type: {type(titanic_df)}')

# df.head(5) : 맨 앞의 5개의 데이터만 출력
display(titanic_df.head(5))

# df.tail(5) : 맨 뒤의 5개의 데이터만 출력
display(titanic_df.tail(5))

# df.shape : 행과 열의 크기를 반환
display(f'{type(titanic_df.shape)} : {titanic_df.shape}')
display(titanic_df.shape)

In [15]:
# DataFrame 생성
# 딕셔너리를 이용하여 DataFrame 생성

temp_dict = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age':[24, 13, 53, 33],
}
# key가 column 이름이 되고, value가 column의 데이터가 된다.

temp_df_01= pd.DataFrame(temp_dict)
display(temp_df_01)


# column 이름을 정하여 DataFrame 생성
temp_df_02 =pd.DataFrame(temp_dict, columns=['Age', 'Name', 'Gender'])
# -> dict의 key에 해당하는 column이 없으면 NaN으로 채워진다.
display(temp_df_02)

    Name  Age
0   John   24
1   Anna   13
2  Peter   53
3  Linda   33

   Age   Name Gender
0   24   John    NaN
1   13   Anna    NaN
2   53  Peter    NaN
3   33  Linda    NaN

In [22]:
# DataFrame의 column 이름 확인
temp_df_02_columns = temp_df_02.columns
print(f'{type(temp_df_02_columns)}:\n{temp_df_02_columns}') # Index 객체로 반환된다.
print('') # 줄바꿈


# DataFrame의 index 확인
temp_df_02_index = temp_df_02.index
print(f'{type(temp_df_02_index)}:\n{temp_df_02_index}') # RangeIndex 객체로 반환된다.


# DataFrame의 values 확인
temp_df_02_values = temp_df_02.values
print(f'{type(temp_df_02_values)}:\n{temp_df_02_values}') # numpy의 ndarray로 반환된다.

<class 'pandas.core.indexes.base.Index'>:
Index(['Age', 'Name', 'Gender'], dtype='object')

<class 'pandas.core.indexes.range.RangeIndex'>:
RangeIndex(start=0, stop=4, step=1)
<class 'numpy.ndarray'>:
[[24 'John' nan]
 [13 'Anna' nan]
 [53 'Peter' nan]
 [33 'Linda' nan]]

In [25]:
# DataFrame의 정보 확인
temp_df_02_info = temp_df_02.info()
print(f'{temp_df_02_info}') # info()는 None을 반환한다.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     4 non-null      int64
 1   Name    4 non-null      object
 2   Gender  0 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes
None

In [29]:
# DataFrame의 기초 통계 정보 확인
titanic_df=pd.read_csv('./titanic_train.csv')
titanic_df.describe()
print(f'{type(titanic_df.describe())}')

# value_counts() : Series 객채의 메소드. 해당 series의 값 분포를 확인.
titanic_Pclass_value_counts=titanic_df['Pclass'].value_counts(dropna=False)
print(f'{type(titanic_Pclass_value_counts)}:\n{titanic_Pclass_value_counts}')

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>:
Pclass
3    491
1    216
2    184
Name: count, dtype: int64

# DataFrame <-> list, dict, ndarray 변환

In [66]:
# list -> DataFrame
temp_list=[24,13,53,33]
temp_df_from_list = pd.DataFrame(temp_list, columns=['age'])
display(temp_df_from_list)

# dict -> DataFrame
temp_dict_01 = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age':[24, 13, 53, 33],
}
temp_df_from_dict_01 = pd.DataFrame(temp_dict_01)
display(temp_df_from_dict_01)

# JSON 같은 형태의 데이터가 들어오면 어떻게 하나?
temp_dict_02 = {'user01':{'Name':'John', 'Age':24}, 'user02':{'Name':'Anna', 'Age':13}, 'user03':{'Name':'Peter', 'Age':53}, 'user04':{'Name':'Linda', 'Age':33}}

temp_df_from_dict_02 = pd.DataFrame(temp_dict_02)
display(temp_df_from_dict_02)

# change temp_dict_02 to make df with columns=['Name', 'Age']
temp_df_from_dict_02 = pd.DataFrame(temp_dict_02).T
display(temp_df_from_dict_02)


# ndarray -> DataFrame
import numpy as np

temp_ndarray = np.array([[24, 13, 53, 33], ['John', 'Anna', 'Peter', 'Linda']])
temp_df_from_ndarray = pd.DataFrame(temp_ndarray.T, columns=['Age', 'Name'])
display(temp_df_from_ndarray)

   age
0   24
1   13
2   53
3   33

    Name  Age
0   John   24
1   Anna   13
2  Peter   53
3  Linda   33

     user01 user02 user03 user04
Name   John   Anna  Peter  Linda
Age      24     13     53     33

         Name Age
user01   John  24
user02   Anna  13
user03  Peter  53
user04  Linda  33

  Age   Name
0  24   John
1  13   Anna
2  53  Peter
3  33  Linda

In [67]:
# DataFrame -> list
# values 속성으로 ndarray화. 이후 tolist()로 리스트화.
list_from_df = temp_df_from_dict_02.values.tolist()
print(f'{type(list_from_df)}:\n{list_from_df}')

# DataFrame -> ndarray
# values 속성으로 ndarray화.
ndarray_from_df = temp_df_from_dict_02.values
print(f'{type(ndarray_from_df)}:\n{ndarray_from_df}')

# DataFrame -> dict
# df.to_dict() method 이용 dict화.
dict_from_df=temp_df_from_dict_02.to_dict()
print(f'{type(dict_from_df)}:\n{dict_from_df}')

<class 'list'>:
[['John', 24], ['Anna', 13], ['Peter', 53], ['Linda', 33]]
<class 'numpy.ndarray'>:
[['John' 24]
 ['Anna' 13]
 ['Peter' 53]
 ['Linda' 33]]
<class 'dict'>:
{'Name': {'user01': 'John', 'user02': 'Anna', 'user03': 'Peter', 'user04': 'Linda'}, 'Age': {'user01': 24, 'user02': 13, 'user03': 53, 'user04': 33}}

# DataFrame 데이터 생성, 변경, 삭제

In [68]:
display(temp_df_from_dict_02)
temp_df_from_dict_03 = temp_df_from_dict_02
# 새로운 컬럼 생성
temp_df_from_dict_03['new_col'] = [1,2,3,4]
temp_df_from_dict_03['new_col_x10'] =temp_df_from_dict_03['new_col']*10
display(temp_df_from_dict_03)

# 컬럼 값 변경
temp_df_from_dict_03['new_col'] = [5,6,7,8]
display(temp_df_from_dict_03)

         Name Age
user01   John  24
user02   Anna  13
user03  Peter  53
user04  Linda  33

         Name Age  new_col  new_col_x10
user01   John  24        1           10
user02   Anna  13        2           20
user03  Peter  53        3           30
user04  Linda  33        4           40

         Name Age  new_col  new_col_x10
user01   John  24        5           10
user02   Anna  13        6           20
user03  Peter  53        7           30
user04  Linda  33        8           40

In [69]:
# DataFrame 데이터 삭제
# df.drop() method 이용한다.
# axis=0 이면 row, axis=1 이면 column 의미.
# inplace=True 이면 원본 DataFrame을 변경한다. 기본값은 False.
temp_df=temp_df_from_dict_03

temp_df_dropped=temp_df.drop(labels=['Age','new_col'], axis=1)
display(temp_df_dropped)
display(temp_df)

         Name  new_col_x10
user01   John           10
user02   Anna           20
user03  Peter           30
user04  Linda           40

         Name Age  new_col  new_col_x10
user01   John  24        5           10
user02   Anna  13        6           20
user03  Peter  53        7           30
user04  Linda  33        8           40

# Index 객체

In [78]:
# Index 객체에 대하여
# Index 객체는 DataFrame, Series의 각 정보를 고유하게 식별하는 역할.
# 이 때, 만들어진 df 앞에 붙어있는 Index는 하나의 컬럼으로 인식되지 않는다.

# Index 객체의 추출을 위해선 dataframe/series의 index 속성을 이용한다.
temp_df_for_index=temp_df_from_dict_03
display(temp_df_for_index.index)
index_array = temp_df_for_index.index.values # 값을 받아와 쓰려면 ndarray로 받아온다.
print(f'{type(index_array)}:\n{index_array}')

# Index를 초기화하려면 dataframe/series 의 reset_index() 함수를 이용한다.
# 이때도 기존에 있던 dataframe을 이용하려는게 기본설정이라 inplace=False 되어있다.
# 메모리 아끼기 위해서 inplace=True로 바꿔줄 수 있다.
# 인덱스 리셋되면 기존 인덱스는 가장 첫 column에 index 이름으로 만들어진다.
# 새로운 인덱스는 RangeIndex로 초기화된다.
df_index_reset = temp_df_for_index.reset_index() # inplace=False 기본.
display(df_index_reset)
print(f'{type(df_index_reset.index)}:\n{df_index_reset.index}')

# 변경하려면 Index 객체에 새로운 정보들을 list로 넣어준다.
df_index_reset.index=[10,11,12,13]
display(df_index_reset)
print(f'{type(df_index_reset.index)}:\n{df_index_reset.index}')

Index(['user01', 'user02', 'user03', 'user04'], dtype='object')

<class 'numpy.ndarray'>:
['user01' 'user02' 'user03' 'user04']

    index   Name Age  new_col  new_col_x10
0  user01   John  24        5           10
1  user02   Anna  13        6           20
2  user03  Peter  53        7           30
3  user04  Linda  33        8           40

<class 'pandas.core.indexes.range.RangeIndex'>:
RangeIndex(start=0, stop=4, step=1)

     index   Name Age  new_col  new_col_x10
10  user01   John  24        5           10
11  user02   Anna  13        6           20
12  user03  Peter  53        7           30
13  user04  Linda  33        8           40

<class 'pandas.core.indexes.base.Index'>:
Index([10, 11, 12, 13], dtype='int64')